# 두 자연수 A와 B가 있을 때, A = BC를 만족하는 자연수 C를 A의 약수라고 한다.
# 예를 들어, 2의 약수는 1, 2가 있고, 24의 약수는 1, 2, 3, 4, 6, 8, 12, 24가 있다.
# 자연수 A의 약수의 합은 A의 모든 약수를 더한 값이고, f(A)로 표현한다.
# x보다 작거나 같은 모든 자연수 y의 f(y)값을 더한 값은 g(x)로 표현한다.
# 자연수 N이 주어졌을 때, g(N)을 구해보자.

# ex)
# 1 : 1 = 1                                                                     f(1) = 1,  g(1) = f(1) = 1
# 2 : 1 + (1+2) = 4                                                             f(2) = 3,  g(2) = f(1) + f(2) = 4
# 3 : 1 + (1+2) + (1+3) = 8                                                     f(3) = 4,  g(3) = f(1) + f(2) + f(3) = 8
# 4 : 1 + (1+2) + (1+3) + (1+2+4) = 15                                          f(4) = 7,  g(4) = f(1) + f(2) + f(3) + f(4) = 15
# 5 : 1 + (1+2) + (1+3) + (1+2+4) + (1+5) = 21                                  f(5) = 6,  g(5) = f(1) + f(2) + f(3) + f(4) + f(5) = 21
# 6 : 1 + (1+2) + (1+3) + (1+2+4) + (1+5) + (1+2+3+6) = 33
# 7 : 1 + (1+2) + (1+3) + (1+2+4) + (1+5) + (1+2+3+6) + (1+7) = 41
# 8 : 1 + (1+2) + (1+3) + (1+2+4) + (1+5) + (1+2+3+6) + (1+7) + (1+2+4+8) = 56

# Test 1
# n = int(input())
# divisor = 0
# sum = 0

# for i in range(1, n+1):
#     divisor = 0
#     for j in range(1, i+1):
#         if(i % j == 0):
#             divisor += j
#     sum += divisor
#     print(i, '의 약수의 합:', divisor, '\t', 'g(x) : ', sum)


# n = int(input())
# sum = 0

# for i in range(1, n+1):
#     sum += (n//i) * i

# print(sum)
